Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Origin
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.xDir
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Extrusion
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.ProfileName
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double1
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double2
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double3
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double4
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double5
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double6
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double7
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double8
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotIFC2X3_ParametricObject_ShapeProfile_t.Double9
DO NOT USE! For internal usage only!